A2 de Linguagens de Programação – 26/11/2018
--
Professor: Renato Rocha Souza  
--

Nome do Aluno(a):

In [ ]:
meu_nome = input('Entre com o seu nome completo: ')
print('Olá, {}!'.format(meu_nome))
print('Bom trabalho!')

In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import requests
import random
import re
import string
import time
import pymysql
import sqlite3
import getpass
import pandas.io.sql as psql
import networkx as nx
from IPython.display import clear_output
%matplotlib inline

Questão 1 (1,0 ponto):  

Utilizando Python + SQL, crie uma tabela "aluno" em banco de dados no sqlite que tenha os seguintes campos:

+ id 
+ nome
+ data_nascimento
+ matricula

Escolha os tipos de dados apropriados. O campo id é chave primária, e deve ser autoincrementável. 

Veja:  
https://sqlite.org/datatype3.html    
https://sqlite.org/autoinc.html  
https://www.tutorialspoint.com/sqlite/sqlite_update_query.htm

In [2]:
conn = sqlite3.connect('../../Dados/meudatabase.sqlite')
cur = conn.cursor()

In [250]:
q = '''CREATE TABLE IF NOT EXISTS tabelinha
       (id int auto_increment primary key,
        nome VARCHAR(200) DEFAULT NULL,
        data_nascimento DATE DEFAULT NULL,
        matrícula VARCHAR(100) DEFAULT NULL,
        idade int(100))'''

 
cur.execute(q)

In [130]:
t = 'Insert into aluninha(nome, matrícula) values("%s", "%s")'
val =[ ("Hermione", 8),("Harry", 9),("Rony", 8), ("Luna",7)]
cur.executemany(t, val)

ProgrammingError: Incorrect number of bindings supplied. The current statement uses 0, and there are 2 supplied.

In [247]:
j =fun('select * from aluninha where nome GLOB "*an*"')
for x in range(len(j)):
    print(j[x][0])

In [248]:
fun('SELECT * FROM aluninha order by nome asc, idade asc')

OperationalError: no such column: idade

In [149]:
cur.execute('DELETE FROM aluninha WHERE nome = "Beltrano"')

In [251]:
t = [('Anamaria', None, 'a3555', 11, 15),
     ('Cícero', 0, 'B37564', 12, 16),
     ('Felipe', 0, 'B12784', 13, 17),
     ('Joana', None, '111', 14, 18),
     ('Marta', None, '54325', 15, 19),
     ('Maurinho', None, '123', 16, 27)]

cur.executemany('INSERT INTO tabelinha VALUES (?,?,?,?,?)', t)

In [252]:
fun('select * from tabelinha')

[('Anamaria', None, 'a3555', '11', 15),
 ('Cícero', '0', 'B37564', '12', 16),
 ('Felipe', '0', 'B12784', '13', 17),
 ('Joana', None, 111, '14', 18),
 ('Marta', None, 54325, '15', 19),
 ('Maurinho', None, 123, '16', 27)]

In [200]:
fun('UPDATE aluninha SET nome = "Maria" WHERE nome="José" ')

[]

In [102]:
fun('ALTER TABLE aluninha ADD COLUMN idade INT(3)')

[]

In [151]:
fun('alter table aluninha AUTO_INCREMENT =1')

OperationalError: near "AUTO_INCREMENT": syntax error

In [131]:
cur.execute('''INSERT INTO aluninha(id, nome, data_nascimento, matrícula)
            VALUES 
            (1,'Fulano', 11/02/74, 'B12784' ),
            (2,'Ciclano',09/09/88,'B37564'),
            (3, 'Beltrano', 05/07/99 ,'b99268');''')

In [11]:
def fun(comando):
    cur.execute(comando)
    l=[]
    for r in cur.fetchall():
        l.append(r)
    return l

In [87]:
cur.execute('select * from aluno')
for r in cur.fetchall():
    print(r)

(1, 'Fulano', '1999/10/05', 'B12784')
(3, 'Beltrano', '1971/07/22', 'b99268')
(50, 'Maria', '1888/07/09)', 'b35422')

In [46]:
fun('select * from aluno')

[(1, 'Fulano', 0, 'B12784'),
 (2, 'Ciclano', 0, 'B37564'),
 (3, 'Beltrano', 0, 'b99268')]

In [61]:
for r in range(len(cur.description)):
    print(cur.description[r][0])

id
nome
data_nascimento
matrícula

In [92]:
fun("SHOW DATABASES")

OperationalError: near "SHOW": syntax error

In [41]:
cur.execute('select * from aluno limit[0]')
print(cur.describe)

OperationalError: no such column: 0

In [73]:
fun('UPDATE aluno SET data_nascimento = "1971/07/22" WHERE id = 3')

[]

In [77]:
fun('DELETE FROM aluno WHERE id = 2')

[]

In [81]:
fun('insert into aluno(id,nome, data_nascimento, matrícula) values (50,"Maria", "1888/07/09)", "b35422")')

[]

In [82]:
fun('SELECT * from aluno')

[(1, 'Fulano', '1999/10/05', 'B12784'),
 (3, 'Beltrano', '1971/07/22', 'b99268'),
 (50, 'Maria', '1888/07/09)', 'b35422')]

Questão 2 (1.5 ponto):  

Conecte ao banco SQLite "iris_database.sqlite"e responda, demonstrando os comandos Python + SQL apropriados:  

a) Há quantas "Species" diferentes na tabela "iris"?  
b) Quantos registros totais há na tabela "iris"?  

Considerando a superfície das pétalas e sépalas como retangular, responda:  

c) Qual espécie ("Species") contém, em média, a maior área de pétalas?  
d) Qual espécie ("Species") contém, em média, a maior área total (pétalas e sépalas)?  

(Por curiosidade, as espécies de Iris contém 3 pétalas e 3 sépalas)

In [209]:
conn = sqlite3.connect('../../Dados/iris_database.sqlite')
cur = conn.cursor()

In [216]:
#a)
cur.execute('select * from iris ')
for r in cur.description:
    print(r)

('Id', None, None, None, None, None, None)
('SepalLengthCm', None, None, None, None, None, None)
('SepalWidthCm', None, None, None, None, None, None)
('PetalLengthCm', None, None, None, None, None, None)
('PetalWidthCm', None, None, None, None, None, None)
('Species', None, None, None, None, None, None)

In [227]:
fun('SELECT * FROM iris GROUP BY Species having PetalLengthCm > 3')

[(100, 5.7, 2.8, 4.1, 1.3, 'Iris-versicolor'),
 (150, 5.9, 3, 5.1, 1.8, 'Iris-virginica')]

In [ ]:
#b)

In [ ]:
#c)

In [ ]:
#d)

Questão 3 (1.5 pontos):  

Importe o arquivo ../../Dados/votesurvey.xls para um dataframe do Python usando o método apropriado, e responda às questões:  

a) Exiba as 15 primeiras linhas (essa é muito fácil!).  
b) Qual a média de salário desejado, dentre os eleitores de cada presidente?  
c) Qual fator tem maior influência sobre o salário atual? Sexo ou Idade?  
d) Crie uma nova coluna no dataframe original que exiba o salário atual dividido pela idade.

In [231]:
#a)
t = pd.read_excel('../../Dados/votesurvey.xls')
t[:15]

    Gender  Age  Salary before Stern  Expected salary Candidate
0     Male   27                60000           110000      Bush
1     Male   30               125000           125000      Bush
2     Male   27                50000           120000      Bush
3     Male   26                56000           100000      Bush
4     Male   27                82000           100000      Bush
5     Male   32               150000           150000      Bush
6   Female   24                55000           100000      Bush
7     Male   30               110000           150000      Bush
8     Male   26                48000            80000      Bush
9     Male   26               120000            80000      Bush
10  Female   24                59000            90000      Bush
11    Male   27                65000           125000      Bush
12    Male   26                55000           120000      Bush
13    Male   28                70000           125000      Bush
14    Male   25                80000           100000      Bush

In [242]:
#b)
t.groupby('Candidate').mean()

                        Age  Salary before Stern  Expected salary
Candidate
Bush              27.000000         79000.000000    111666.666667
Gore              27.277778         71722.222222    103055.555556
Refuse to answer  27.300000         59600.000000    119500.000000
Undecided         27.200000         59000.000000    103000.000000

In [ ]:
#c)

In [ ]:
#d)

Questão 4 (1.5 pontos): 

Transforme o arquivo ../../Dados/DomCasmurroMachadoAssis.txt em uma string no Python e responda, usando, quando possível, expressões regulares:  

a) Quais as 10 palavras mais frequentes que _começam_ com "a" ou "A"?  
b) Quantas palavras distintas que começam com letras _maiúsculas_ há no texto?  
c) Quantas palavras há no texto com apenas uma; com apenas duas; e com apenas 3 vogais?

In [ ]:
#a)

In [ ]:
#b)

In [ ]:
#c)

Questão 5 (1.5 pontos):    

Utilizando apenas o Shell Linux, e utilizando o arquivo ../../Dados/DomCasmurroMachadoAssis.txt, diga os comandos para responder às seguintes perguntas:  

a) Quais as 10 palavras mais frequentes que _terminam_ com "a" ou "A"?  
b) Quantas palavras distintas que começam com _minúsculas_ há no texto?   
c) Como ordenar as palavras distintas por ordem de "rima"?

In [ ]:
#a)

In [ ]:
#b)

In [ ]:
#c)

Questão 6 (2.0 ponto):  

Conecte ao banco Python/Dados/chinook.sqlite e responda:

a) Leia para dataframes do Pandas as tabelas "invoices", "invoice_items", "customers" e "tracks"; e mostre quais as faixas compradas por clientes que têm o primeiro nome começando com a letra "M".  
b) Crie um histograma de faixas ("tracks") mais compradas.  
c) Escreva um script em Python + SQL para construir um dicionário tendo os nomes dos artistas ("artists") como chaves e uma lista dos álbuns ("albuns") respectivos como valores.

In [ ]:
#a)

In [ ]:
#b)

In [ ]:
#c)

Auto-avaliação (1 ponto):    
Escreva sua auto-avaliação (mínimo de 3 linhas) e atribua a esta um valor entre 0 e 1, levando em consideração o aproveitamento na disciplina.

### Escreva aqui